In [1]:
import pandas as pd

In [5]:
df=pd.read_excel(r"C:\Users\91944\Desktop\homeprices.csv.xlsx")

In [6]:
print(df)

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [7]:
d=pd.DataFrame(df)
print(d)

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [8]:
print(df.shape)

(5, 4)

In [9]:
print(df.head)

<bound method NDFrame.head of    area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000>

In [10]:
print(df.tail)

<bound method NDFrame.tail of    area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000>

In [11]:
print(df.head(2))

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000

In [12]:
#To print rows in the bottom
print(df.tail(2))

   area  bedrooms  age   price
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [13]:
#to print columns
print(df.columns)

Index(['area', 'bedrooms', 'age', 'price'], dtype='object')

In [15]:
#To print specific columns
print(df[['area','bedrooms']])

   area  bedrooms
0  2600       3.0
1  3000       4.0
2  3200       NaN
3  3600       3.0
4  4000       5.0

In [16]:
print(df['area'])

0    2600
1    3000
2    3200
3    3600
4    4000
Name: area, dtype: int64

In [18]:
print(df[2:3])

   area  bedrooms  age   price
2  3200       NaN   18  610000

In [19]:
a=df[1:5]
print(a)

   area  bedrooms  age   price
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [20]:
df.columns

Index(['area', 'bedrooms', 'age', 'price'], dtype='object')

In [21]:
#To print individual column
df.area

0    2600
1    3000
2    3200
3    3600
4    4000
Name: area, dtype: int64

In [22]:
df['area']

0    2600
1    3000
2    3200
3    3600
4    4000
Name: area, dtype: int64

In [26]:
print(df.dtypes)

area          int64
bedrooms    float64
age           int64
price         int64
dtype: object

In [27]:
print(df['area'].dtype)

int64

In [29]:
type(df['area'])

pandas.core.series.Series

In [30]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [31]:
print(df[['area','age']])

   area  age
0  2600   20
1  3000   15
2  3200   18
3  3600   30
4  4000    8

In [32]:
print(df.columns)

Index(['area', 'bedrooms', 'age', 'price'], dtype='object')

In [33]:
df['age']

0    20
1    15
2    18
3    30
4     8
Name: age, dtype: int64

In [35]:
df['age'].max()

30

In [36]:
df['age'].min()

8

In [37]:
df['age'].mean()

18.2

In [39]:
df['age'].std()

8.01249024960405

In [40]:
df['age'].median()

18.0

In [41]:
df['age'].mode()

0     8
1    15
2    18
3    20
4    30
Name: age, dtype: int64

In [42]:
df.describe()

              area  bedrooms       age          price
count     5.000000  4.000000   5.00000       5.000000
mean   3280.000000  3.750000  18.20000  616000.000000
std     540.370243  0.957427   8.01249   83919.604384
min    2600.000000  3.000000   8.00000  550000.000000
25%    3000.000000  3.000000  15.00000  565000.000000
50%    3200.000000  3.500000  18.00000  595000.000000
75%    3600.000000  4.250000  20.00000  610000.000000
max    4000.000000  5.000000  30.00000  760000.000000

In [44]:
df[df.age>3]

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [46]:
df[['area','age']].max()

area    4000
age       30
dtype: int64

In [47]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [48]:
df.set_index('age')

     area  bedrooms   price
age
20   2600       3.0  550000
15   3000       4.0  565000
18   3200       NaN  610000
30   3600       3.0  595000
8    4000       5.0  760000

In [51]:
df.loc[0]

area          2600.0
bedrooms         3.0
age             20.0
price       550000.0
Name: 0, dtype: float64

In [52]:
df.loc[3]

area          3600.0
bedrooms         3.0
age             30.0
price       595000.0
Name: 3, dtype: float64

In [53]:
df.set_index('age')

     area  bedrooms   price
age
20   2600       3.0  550000
15   3000       4.0  565000
18   3200       NaN  610000
30   3600       3.0  595000
8    4000       5.0  760000

In [54]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [56]:
df.set_index('area',inplace=True)

In [57]:
df

      bedrooms  age   price
area
2600       3.0   20  550000
3000       4.0   15  565000
3200       NaN   18  610000
3600       3.0   30  595000
4000       5.0    8  760000

In [63]:
df.loc[2600],['age']

(bedrooms         3.0
 age             20.0
 price       550000.0
 Name: 2600, dtype: float64,
 ['age'])

In [64]:
#To keep the changes as in begining
df.reset_index(inplace=True)

In [65]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [67]:
df.to_csv('datat.csv')

In [69]:
df.columns

Index(['area', 'bedrooms', 'age', 'price'], dtype='object')

In [71]:
df.to_csv('datat.csv',columns=['area','price'], index=False)

In [73]:
df.to_csv('datat.csv', header=False)